app/Controllers/Home.php

    public function index()
    {
        $tim = $this->clubModel->showClub();
        $cat = $this->categoryModel->get();
---
SELECT *
FROM `categories`

    public function club() {
        $getClub = $this->clubModel->get();
---
SELECT *
FROM `clubs`