app/Controllers/Registration.php

INSERT INTO `users` (`nama_lengkap`, `jk`, `tanggal_lahir`, `photo`, `berat_badan`, `akte`, `geup`, `club_id`) VALUES ('ling', 'PUTRA', '2022-11-11', '1668941331k2.png', '', '1668941331p1.png', '1668941331k2.png', '11')
---
                    $file['akte'][$i]->move('akte', $akte);
                    $file['geup'][$i]->move('geup', $geup);
                    $berat = str_replace(',', '.', trim($post['berat_badan'][$i]));
                    $this->userModel->save([
                        'nama_lengkap' => $post['nama'][$i],
                        'jk' => $post['jenis_kelamin'][$i],
                        'tanggal_lahir' => $post['tgl_lahir'][$i],
                        'photo' => $foto,
                        'berat_badan' => $berat,
                        'akte' => $akte,
                        'geup' => $geup,
                        'club_id' => $post['tim']
                    ]);

INSERT INTO `users` (`nama_lengkap`, `jk`, `tanggal_lahir`, `photo`, `akte`, `geup`, `club_id`) VALUES ('asep', 'PUTRI', '2022-11-18', '1668941205k2.png', '1668941205k2.png', '1668941205k1.png', '11')
---
                        $file['foto'][$i]->move('foto', $foto);
                        $file['akte'][$i]->move('akte', $akte);
                        $file['geup'][$i]->move('geup', $geup);
                        $this->userModel->save([
                            'nama_lengkap' => $post['nama'][$i],
                            'jk' => $post['jenis_kelamin'][$i],
                            'tanggal_lahir' => $post['tgl_lahir'][$i],
                            'photo' => $foto,
                            'akte' => $akte,
                            'geup' => $geup,
                            'club_id' => $post['tim']
                        ]);

SELECT *
FROM `clubs`
WHERE `clubs`.`id` = '11'
---
            }
        }
        $total = ($kyorugi * 350000) + ($poomsaeIndividu * 350000) + ($poomsaePair * 500000) + ($poomsaeGroup * 600000);
        $getTim = $this->clubModel->find($post['tim']);

SELECT *
FROM `clubs`
WHERE `clubs`.`id` = '11'
---
    public function submitPeserta() {
        $post = $this->request->getVar();
        print_r($post);

        $kyorugi = $post['kyorugi'];
        $poomsaeIndividu = $post['individu'];
        $poomsaePair = $post['pair'];
        $poomsaeGroup = $post['group'];
        $total = ($kyorugi * 350000) + ($poomsaeIndividu * 350000) + ($poomsaePair * 500000) + ($poomsaeGroup * 600000);
        $getTim = $this->clubModel->find($post['tim']);