app/Models/Categories.php

    public function showClassKyorugi() {
        $query = $this->db->table("categories")
            ->where('jenis', 'kyorugi')
            ->get();
---
SELECT *
FROM `categories`
WHERE `jenis` = 'kyorugi'

    public function showClassPoomsaeIndividu() {
        $query = $this->db->table("categories")
            ->where('jenis', 'individual')
            ->get();
---
SELECT *
FROM `categories`
WHERE `jenis` = 'individual'

    public function showClassPoomsaePair() {
        $query = $this->db->table("categories")
            ->where('jenis', 'pair')
            ->get();
---
SELECT *
FROM `categories`
WHERE `jenis` = 'pair'

    public function showClassPoomsaeGroup() {
        $query = $this->db->table("categories")
            ->where('jenis', 'beregu')
            ->get();
---
SELECT *
FROM `categories`
WHERE `jenis` = 'beregu'

    public function saveClass($data) {
        $this->db->table('class_detail')->insert($data);
---
INSERT INTO `class_detail` (`category_id`, `class_id`, `person`, `user_1`) VALUES ('1', '0', 'kyorugi', 132)

    public function saveInvoice($invoice, $id, $total) {
        $this->db->table('invoice')->insert([
            'invoice' => $invoice,
            'tim' => $id,
            'total' => $total
        ]);
---
INSERT INTO `invoice` (`invoice`, `tim`, `total`) VALUES ('VO23-7942-11', '11', 350000)

    public function getClassPutra() {
        $query = $this->db->table('class')
            ->where('jk', 'PUTRA')
            ->get();
---
SELECT *
FROM `class`
WHERE `jk` = 'PUTRA'

    public function getClassPutri() {
        $query = $this->db->table('class')
            ->where('jk', 'PUTRI')
            ->get();
---
SELECT *
FROM `class`
WHERE `jk` = 'PUTRI'