app/Models/Clubs.php

SELECT *
FROM `clubs`
ORDER BY `nama_club` ASC
---
    public function showClub() {
        $query = $this->db->table('clubs')->orderBy('nama_club', 'ASC')->get();

SELECT COUNT(*) as total
FROM `clubs`
---
    public function getTotalClub() {
        $query = $this->db->table('clubs')
            ->select('COUNT(*) as total')
            ->get();

SELECT *
FROM `invoice`
JOIN `clubs` ON `clubs`.`id` = `invoice`.`tim`
ORDER BY `invoice`.`id` DESC
---
    public function getInvoice() {
        $query = $this->db->table('invoice')
            ->join('clubs', 'clubs.id = invoice.tim')
            ->orderBy('invoice.id', 'DESC')
            ->get();