app/Models/Users.php

    public function getTotalPoomsae() {
        $query = $this->db->table('users')
            ->select('COUNT(*) as total')
            ->where('berat_badan', NULL)
            ->get();
---
SELECT COUNT(*) as total
FROM `users`
WHERE `berat_badan` IS NULL

    public function getTotalKyourugi() {
        $query = $this->db->table('users')
            ->select('COUNT(*) as total')
            ->where('berat_badan !=', NULL)
            ->get();
---
SELECT COUNT(*) as total
FROM `users`
WHERE `berat_badan` IS NOT NULL

    public function getPesertaBaru() {
        $query = $this->db->table('users')
            ->join('clubs', 'clubs.id = users.club_id')
            ->orderBy('users.id', 'DESC')->get();
---
SELECT *
FROM `users`
JOIN `clubs` ON `clubs`.`id` = `users`.`club_id`
ORDER BY `users`.`id` DESC

    public function getDataKyourugiPutra() {
        $query = $this->db->table('users')
            ->select('users.id, users.nama_lengkap, users.jk, users.berat_badan, users.tanggal_lahir, clubs.nama_club, categories.jenis, categories.kategori, categories.id as kategori_id')
            ->join('clubs', 'clubs.id = users.club_id')
            ->join('class_detail', 'class_detail.user_1 = users.id')
            ->join('categories', 'categories.id = class_detail.category_id')
            ->where('categories.jenis', 'kyorugi')
            ->where('users.jk', 'PUTRA')
            ->orderBy('clubs.id', 'ASC')->get();
---
SELECT `users`.`id`, `users`.`nama_lengkap`, `users`.`jk`, `users`.`berat_badan`, `users`.`tanggal_lahir`, `clubs`.`nama_club`, `categories`.`jenis`, `categories`.`kategori`, `categories`.`id` as `kategori_id`
FROM `users`
JOIN `clubs` ON `clubs`.`id` = `users`.`club_id`
JOIN `class_detail` ON `class_detail`.`user_1` = `users`.`id`
JOIN `categories` ON `categories`.`id` = `class_detail`.`category_id`
WHERE `categories`.`jenis` = 'kyorugi'
AND `users`.`jk` = 'PUTRA'
ORDER BY `clubs`.`id` ASC

    public function getDataKyourugiPutri() {
        $query = $this->db->table('users')
            ->select('users.id, users.nama_lengkap, users.jk, users.berat_badan, users.tanggal_lahir, clubs.nama_club, categories.jenis, categories.kategori, categories.id as kategori_id')
            ->join('clubs', 'clubs.id = users.club_id')
            ->join('class_detail', 'class_detail.user_1 = users.id')
            ->join('categories', 'categories.id = class_detail.category_id')
            ->where('categories.jenis', 'kyorugi')
            ->where('users.jk', 'PUTRI')
            ->orderBy('clubs.id', 'ASC')->get();
---
SELECT `users`.`id`, `users`.`nama_lengkap`, `users`.`jk`, `users`.`berat_badan`, `users`.`tanggal_lahir`, `clubs`.`nama_club`, `categories`.`jenis`, `categories`.`kategori`, `categories`.`id` as `kategori_id`
FROM `users`
JOIN `clubs` ON `clubs`.`id` = `users`.`club_id`
JOIN `class_detail` ON `class_detail`.`user_1` = `users`.`id`
JOIN `categories` ON `categories`.`id` = `class_detail`.`category_id`
WHERE `categories`.`jenis` = 'kyorugi'
AND `users`.`jk` = 'PUTRI'
ORDER BY `clubs`.`id` ASC